#pragma once

// This file is generated by Jack

#include <cstdint>
#include <RED4ext/Common.hpp>
#include <RED4ext/NativeTypes.hpp>
#include <RED4ext/Scripting/Natives/Generated/WorldTransform.hpp>
#include <RED4ext/Scripting/Natives/Generated/Transform.hpp>

namespace RED4ext::vehicle
{

struct Collisions {

    // 1.52 RVA: 0x1AB9B80 / 28023680
    /// @pattern C7 41 3C 00 00 80 3F 33 C0 48 89 41 20 0F 57 C0 89 41 28 48 89 41 30 89 41 38 48 89 01 48 89 41
    // Collisions();

    // 1.52 RVA: 0x1ABAA10 / 28027408
    /// @pattern 0F 10 81 A0 00 00 00 0F 57 C9 0F 11 81 B0 00 00 00 0F 11 89 A0 00 00 00 C3
    void __fastcall CopyOverCollisionForce();

    // 1.52 RVA: 0x1ABAA30 / 28027440
    /// @pattern 0F 10 02 0F 11 81 D0 00 00 00 C3
    void __fastcall SetUnkD0(void *a2);

    // 1.52 RVA: 0x1ABAA40 / 28027456
    /// @pattern 0F 10 02 0F 11 81 C0 00 00 00 C3
    // void __fastcall SetRotationalVelocityMaybe(Vector4 *);

    // 1.52 RVA: 0x1ABAA50 / 28027472
    /// @pattern 48 83 EC 58 0F 29 74 24 40 0F 29 7C 24 30 44 0F 29 44 24 20 44 0F 29 4C 24 10 44 0F 10 0A 44 0F
    __int64 __fastcall SetAcceleration(Vector4 *);

    // 1.52 RVA: 0x1ABACA0 / 28028064
    /// @pattern 48 83 EC 48 0F 10 61 30 0F 28 DC 0F 29 74 24 30 0F 59 DC 0F 29 7C 24 20 44 0F 29 44 24 10 44 0F
    void __fastcall SetLinearVelocityEtc(Vector4 *);

    float unk00[3];
    float turnRelated;
		WorldTransform worldTransform; // 10
		Vector4 linearVelocity; // 30
		Vector3 acceleration; // 40
			// actually velocity, maybe - dot product taken @ 0x1CED337
		Transform unk50; // 50
		Vector4 unk70; // 70
		Vector4 unk80; // 80
		float currentForce; // 90
		Vector3 currentForceVector; // 94
		float collisionForce; // A0
		Vector3 collisionForceVector; // A4
		float unkB0;
		float unkB4;
		float unkB8; // used a bit
		float unkBC;
		float unkC0;
		float unkC4;
		float unkC8; // used a bit
		float unkCC;
		float unkD0;
		float unkD4;
		float unkD8;
		float unkDC;
		float accelerationMaybe; // E0
		float unkE4; 
		float unkE8; 
		float unkEC; 
		float unkF0;
		float unkF4;
		float unkF8;
		float unkFC;
		float unk100;
		float downforceMaybe; // 104
		float gravityScalar; // 108
		float unk11C; // 10C
};
// RED4EXT_ASSERT_SIZE(Collisions, 0x100);

}